{  
   "name":"b_day0_pre",
   "dialogs":[  
      {  
         "background":"class_room",
         "text":"Когда я вошёл в аудиторию, то был готов увидеть за кафедрой кого угодно: дряхлого профессора с крючковатым носом и остроконечной шляпой, нервного доктора наук с тяжелым взглядом и тростью, экзальтированного аспиранта, фантастическую красавицу... но никак не девушку младше себя! На вид, ей можно было дать лет четырнадцать, не больше. Чтобы хоть как-то видеть нас из-за кафедры, ей пришлось залезть с ногами на стул. Чему ты хочешь научить нас, солнышко? Ты хоть квадратные уравнения решать умеешь?",
         "cloud":"cloud_story"
      },
      {  
         "text":"Молча, как и подобает будущим магам, мы расселись по залу и уставились на своего миниатюрного преподавателя. Её лицо тут же пошло пятнами. Казалось, она сейчас расплачется и убежит, зовя маму."
      },
      {  
         "showPersons":[  
            {  
               "name":"Haru-sensei",
               "img":"chair",
               "pos":{  
                  "x":"0",
                  "y":"0",
                  "z":"10",
                  "s":"1"
               }
            }
         ],
         "name":"Haru-sensei",
         "text":"'LET THE LIGHT SHINE BRIGHTER!'",
         "cloud":"cloud_center"
      },
      {  
         "text":"Произнесла девчушка внезапно абсолютно ровным и спокойным голосом магическую формулу. Сейчас же лампы под потолком зажглись ярче, и даже солнечный свет за окном, будто набрав силу, засиял по-летнему.",
         "cloud":"cloud_story"
      },
      {  
         "text":"Я помню, сколько сил мне стоило заставить пламя свечи заколыхаться, но заклинание, подчинившее свет, казалось, совсем никак на неё не повлияло!"
      },
      {  
         "name":"Haru-sensei",
         "text":"- Меня зовут Хару-сенсей - представилась она тонким детским голоском",
         "cloud":"cloud_center"
      },
      {  
         "text":"- Наверняка, каждый из вас помнит, как тяжело ему пришлось на экзамене - заметила она неуверенно."
      },
      {  
         "name":"Dezo",
         "text":"Ага, как же! Я-то был выжат, как лимон. А вот ты, деточка, похоже сдавала экзамен не напрягаясь!",
         "cloud":"cloud_think"
      },
      {  
         "name":"Haru-sensei",
         "text":"- Порог усталости можно поднять регулярными тренировками и поддержанием физической формы. Каждое заклятие имеет собственную формулу, требует разной концентрации и, следовательно, по-разному утомляет. Сегодня мы разучим простое заклинание, которое воплощает предметы. Для начала попробуем сотворить яблоко",
         "cloud":"cloud_center"
      },
      {  
         "text":"- THERE IS AN APPLE ON THE DESK! - громко и чётко произнёс наш маленький учитель. "
      },
      {  
         "text":"И тут же перед ней появилось самое настоящее яблоко. Сочное, свежее, точно его только сейчас сняли с ветки. Мне сразу же вспомнилось, что я не успел толком позавтракать.",
         "cloud":"cloud_story"
      },
      {  
         "name":"Haru-sensei",
         "text":"- THERE IS - формула существования. Так вам следует начинать заклинание воплощения.",
         "cloud":"cloud_center"
      },
      {  
         "text":"- AN APPLE - Так вы воплощаете конкретный предмет. В данном случае - яблоко."
      },
      {  
         "text":"- ON THE DESK - завершает формулу, указывая, где яблоку появиться. В данном случае, на столе."
      },
      {  
         "text":"- THERE IS AN APPLE ON THE DESK! - снова произнесла она, и второе аппетитнейшее яблоко появилось перед ней - Теперь, ваша очередь."
      },
      {  
         "name":"Dezo",
         "text":"- Ну всё! Теперь точно наемся до отвала! - подумал я. Видимо, не я один",
         "cloud":"cloud_think"
      },
      {  
         "showPersons":[  
            {  
               "name":"bot_male_1",
               "pos":{  
                  "x":"4",
                  "y":"0",
                  "z":"10",
                  "s":"1"
               }
            }
         ],
         "hidePerson":[  
            {  
               "name":"Haru-sensei"
            }
         ],
         "name":"bot_male_1",
         "text":"- Зес инэпл он зетебл! - заорал мой сосед справа. В наступившей тишине отчётливо раздался звук косточки, упавшей на парту. Возможно, яблочной.",
         "cloud":"cloud_right"
      },
      {  
         "showPersons":[  
            {  
               "name":"bot_female_1",
               "pos":{  
                  "x":"-4",
                  "y":"0",
                  "z":"10",
                  "s":"1"
               }
            }
         ],
         "name":"bot_female_1",
         "text":"- Зеас энэпл он зе тэйбл - неуверенно произнесла девочка слева. На голову ей упал чудесный огрызок. От голода, который внезапно разыгрался, даже он показался мне вкусным.",
         "cloud":"cloud_left"
      },
      {  
         "showPersons":[  
            {  
               "name":"Haru-sensei",
               "pos":{  
                  "x":"0",
                  "y":"0",
                  "z":"10",
                  "s":"1"
               }
            }
         ],
         "hidePerson":[  
            {  
               "name":"bot_male_1"
            },
            {  
               "name":"bot_female_1"
            }
         ],
         "name":"Haru-sensei",
         "text":"- Следите за моим произношением, чётче проговаривайте звуки! THERE IS AN APPLE ON THE DESK! - Да куда ж тебе столько яблок-то ненасытная?! Ладно, теперь моя очередь!",
         "cloud":"cloud_center"
      },
      {  
         "hidePerson":[  
            {  
               "name":"Haru-sensei"
            }
         ],
         "name":"Dezo",
         "showMagic":{  
            "task":"Сотвори яблоко у себя на столе, как учила Хару-сенсей",
            "response":"There is an apple on the desk"
         }
      },
      {  
         "text":"После урока я вышел сжимая в руках своё первое сотворённое яблоко. Не очень красивое, с продавлинками, но настоящее! Впрочем, кажется, это отняло все мои силы. В качестве домашней работы нам задали сотворить банан, апельсин, манго и, если получится, ананас. Результаты тренировок мы должны были принести на следующий день на оценку.",
         "cloud":"cloud_think"
      },
      {  
         "showPersons":[  
            {  
               "name":"bot_male_1",
               "pos":{  
                  "x":"0",
                  "y":"0",
                  "z":"10",
                  "s":"1"
               }
            }
         ],
         "text":"В дверях аудитории я столкнулся со своим соседом справа, тем самым, у которого кроме яблочных косточек ничего больше не получилось. ",
         "cloud":"cloud_story"
      },
      {  
         "name":"Dezo",
         "text":"- Куда после академии?",
         "cloud":"cloud_GG"
      },
      {  
         "name":"bot_male_1",
         "text":"- На фруктовый рынок - буркнул он и угрюмо поплёлся В сторону столовой.",
         "cloud":"cloud_center"
      },
      {  
         "background":"black _screen",
         "name":"Dezo",
         "text":"Прошло 2 месяца хоть что-то стало получаться, а вначале было совсем плохо…",
         "cloud":"cloud_think",
         "trigger":[  
            {  
               "minTemp":"0",
               "maxTemp":"1000",
               "branch":"b_0"
            }
         ]
      }
   ]
}